/* ------------------------------------------------------------------------- */
///
/// NotifyItem.cs
/// 
/// Copyright (c) 2010 CubeSoft, Inc.
/// 
/// This is distributed under the Microsoft Public License (Ms-PL).
/// See http://www.opensource.org/licenses/ms-pl.html
///
/* ------------------------------------------------------------------------- */
using System;
using System.Drawing;

namespace Cube.Forms
{
    /* --------------------------------------------------------------------- */
    ///
    /// Cube.Forms.NotifyItem
    /// 
    /// <summary>
    /// 通知内容を保持するためのクラスです。
    /// </summary>
    ///
    /* --------------------------------------------------------------------- */
    public class NotifyItem
    {
        #region Properties

        /* ----------------------------------------------------------------- */
        ///
        /// Level
        /// 
        /// <summary>
        /// 通知内容の重要度を取得または設定します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        public NotifyLevel Level { get; set; }

        /* ----------------------------------------------------------------- */
        ///
        /// Title
        /// 
        /// <summary>
        /// 通知内容の本文を取得または設定します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        public string Title { get; set; }

        /* ----------------------------------------------------------------- */
        ///
        /// Image
        /// 
        /// <summary>
        /// 通知内容を表すイメージを取得または設定します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        public Image Image { get; set; }

        /* ----------------------------------------------------------------- */
        ///
        /// DisplayTime
        /// 
        /// <summary>
        /// 通知内容の表示時間を取得または設定します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        public TimeSpan DisplayTime { get; set; }

        /* ----------------------------------------------------------------- */
        ///
        /// InitialDelay
        /// 
        /// <summary>
        /// 通知内容の表示を遅延させる時間を取得または設定します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        public TimeSpan InitialDelay { get; set; }

        /* ----------------------------------------------------------------- */
        ///
        /// Data
        /// 
        /// <summary>
        /// ユーザデータを取得または設定します。
        /// </summary>
        ///
        /* ----------------------------------------------------------------- */
        public object Data { get; set; }

        #endregion
    }
}
